# Pandas

<b>there are two data structure in the Pandas</b><br>
1) Series     (1d array)<br>
2) Dataframe  (2d array)

In [1]:
import pandas as pd

## Series

In [4]:
data = {'a':1234567890, 'b':22222234, 'c':[1,2,3,4,5],'d':{1:12,2:4},'e':(1,2,3)}

In [5]:
pd.Series(data)

a         1234567890
b           22222234
c    [1, 2, 3, 4, 5]
d      {1: 12, 2: 4}
e          (1, 2, 3)
dtype: object

In [47]:
river = ['Ganges', 'Yamuna', 'Missisipi', 'Neil', 'Missouri']
river_ser = pd.Series(river, index = range(25,50,5))
river_ser

25       Ganges
30       Yamuna
35    Missisipi
40         Neil
45     Missouri
dtype: object

In [52]:
# if the Data are missing for the Indexes Pandas create the Nan for the missing value
data = {'b':100, 'a':(200, 36), 'c':10.20}
ser1 = pd.Series(data, index = ['a', 'b', 'c', 'd', 'e'])
print(ser1)

a    (200, 36)
b          100
c         10.2
d          NaN
e          NaN
dtype: object

In [54]:
# But if the Index are not mentioned the the data will be excluded
data = {'b':100, 'a':(200, 36), 'c':10.20}
ser1 = pd.Series(data, index = ['a', 'b'])
print(ser1)

a    (200, 36)
b          100
dtype: object

In [3]:
#melwin Remeber in slicing of the series the end value will be considered 
data = {'b':100, 'a':(200, 36), 'c':10.20,'d':123,'e':809 }
ser1 = pd.Series(data, index = ['a', 'b', 'c', 'd', 'e'])
print(ser1)
print("-----------------------------------------")
print(ser1['a':'c']) # Remeber in slicing of the series the end value will be considered (Inclusive)
print("-----------------------------------------")
print(ser1[:3]) # end Value will be considered when you mention the Index Value
print("-----------------------------------------")
print(ser1[0])
print("-----------------------------------------")
ser1['a'] # why is this not Printed ?
print("-----------------------------------------")
ser1

a    (200, 36)
b          100
c         10.2
d          123
e          809
dtype: object
-----------------------------------------
a    (200, 36)
b          100
c         10.2
dtype: object
-----------------------------------------
a    (200, 36)
b          100
c         10.2
dtype: object
-----------------------------------------
(200, 36)
-----------------------------------------
-----------------------------------------

a    (200, 36)
b          100
c         10.2
d          123
e          809
dtype: object

In [74]:
state = ['UP', 'AP', 'MP', 'KA', 'TN']
cap = ['LKO', 'AMT', 'BHP', 'BEN', 'CHN']
ser_state_cap = pd.Series(index = state, data = cap)
print(ser_state_cap)
print("----------------------------------")
print(ser_state_cap.index)
print("----------------------------------")
print(ser_state_cap.values)
print("----------------------------------")
print(ser_state_cap['UP':'TN':2])

UP    LKO
AP    AMT
MP    BHP
KA    BEN
TN    CHN
dtype: object
----------------------------------
Index(['UP', 'AP', 'MP', 'KA', 'TN'], dtype='object')
----------------------------------
['LKO' 'AMT' 'BHP' 'BEN' 'CHN']
----------------------------------
UP    LKO
MP    BHP
TN    CHN
dtype: object

## Data frame

In [16]:
state = ['UP', 'AP', 'MP', 'KA', 'TN']
state_df = pd.DataFrame(state, columns = ['State_Name'])
state_df

  State_Name
0         UP
1         AP
2         MP
3         KA
4         TN

In [19]:
print(state_df[0:3])
print(state_df.loc[0:3]) # for  loc the end value also be included Remember this !!!!!

  State_Name
0         UP
1         AP
2         MP
  State_Name
0         UP
1         AP
2         MP
3         KA

In [76]:
cap = ['LKO', 'AMT', 'BHP', 'BEN', 'CHN']
cap_df = pd.DataFrame(cap, columns = ['Cap_Name'])
cap_df

  Cap_Name
0      LKO
1      AMT
2      BHP
3      BEN
4      CHN

In [79]:
satae_cap = list(zip(state, cap))
print(satae_cap)
stae_cap_df = pd.DataFrame(satae_cap, columns = ['State_name', 'Cap_name'])
stae_cap_df

[('UP', 'LKO'), ('AP', 'AMT'), ('MP', 'BHP'), ('KA', 'BEN'), ('TN', 'CHN')]

  State_name Cap_name
0         UP      LKO
1         AP      AMT
2         MP      BHP
3         KA      BEN
4         TN      CHN

In [3]:
pop_data = pd.read_csv('population2019.csv')
pop_data.head()

      Location  PopTotal
0  Afghanistan  7752.117
1  Afghanistan  7840.151
2  Afghanistan  7935.996
3  Afghanistan  8039.684
4  Afghanistan  8151.316

In [91]:
print(pop_data.columns)
pop_data = pop_data.dropna()
print("----------------------------------")
pop_data['PopTotal'].max()
print("----------------------------------")
pop_data['PopTotal'].min()
print("----------------------------------")
pop_data.describe(include = 'all')

Index(['Location', 'PopTotal'], dtype='object')
----------------------------------
----------------------------------
----------------------------------

       Location      PopTotal
count    280932  2.809320e+05
unique      474           NaN
top      Europe           NaN
freq       1768           NaN
mean        NaN  4.128536e+05
std         NaN  1.308911e+06
min         NaN  1.510000e-01
25%         NaN  1.240100e+03
50%         NaN  1.420555e+04
75%         NaN  1.171661e+05
max         NaN  2.163274e+07

In [4]:
pop_data[5:10]

      Location  PopTotal
5  Afghanistan  8270.992
6  Afghanistan  8398.873
7  Afghanistan  8535.157
8  Afghanistan  8680.097
9  Afghanistan  8833.947

In [5]:
csv_dataframe = pd.read_csv("datasets/ted_data.csv")
csv_dataframe

,name_speaker,speaker_occupation,title,views,comments
0,Ken Robinson,Author/educator,Do schools kill creativity?,47227110,4553
1,Al Gore,Climate advocate,Averting the climate crisis,3200520,265
2,David Pogue,Technology columnist,Simplicity sells,1636292,124
3,Majora Carter,Activist for environmental justice,Greening the ghetto,1697550,200
4,Hans Rosling,Global health expert; data visionary,The best stats you've ever seen,12005869,593
5,Tony Robbins,Life coach; expert in leadership psychology,Why we do what we do,20685401,672
6,Julia Sweeney,"Actor, comedian, playwright",Letting go of God,3769987,919
7,Joshua Prince-Ramus,Architect,Behind the design of Seattle's library,967741,46
8,Dan Dennett,"Philosopher, cognitive scientist",Let's teach religion -- all religion -- in sch...,2567958,582
9,Rick Warren,"Pastor, author",A life of purpose,3095993,900

In [6]:
csv_excel = pd.read_excel("datasets/football_worldcup.xlsx", 'Sheet 1')
csv_excel

   Year       Country    Winner   Runners-Up  GoalsScored  MatchesPlayed
0  1990         Italy  Germany     Argentina          115             52
1  1994           USA    Brazil        Italy          141             52
2  1998        France    France       Brazil          171             64
3  2002         Japan    Brazil      Germany          161             64
4  2006       Germany     Italy       France          147             64
5  2010  South Africa     Spain  Netherlands          145             64
6  2014        Brazil   Germany    Argentina          171             64

## Creating the data frame

In [10]:
''' Note as you see here when you are creating the DF usng the Dict and List every data must be there 
    if its not there it will throw error '''

d = {'Year':[1990, 1994,1998, 2002],
    'Country' : ['Italy', 'USA', 'France', 'Japan'],
    'Winner': ['Germany', 'Brazil', 'France', 'Brazil'],
    'Goal_Scored' : [115, 141, 171, 161]}
football_df = pd.DataFrame(d)
football_df

   Year Country   Winner  Goal_Scored
0  1990   Italy  Germany          115
1  1994     USA   Brazil          141
2  1998  France   France          171
3  2002   Japan   Brazil          161

In [11]:
# Creating a datafrmae out of series where the no of elements in series are not same
dict_ser = {'Year': pd.Series([1990, 1994,1998], index = [0,1,2]), 
           'Country' :pd.Series(['Italy', 'USA', 'France', 'Japan'], index = [0,1,2,3])}
df_dict_ser = pd.DataFrame(dict_ser)
df_dict_ser

     Year Country
0  1990.0   Italy
1  1994.0     USA
2  1998.0  France
3     NaN   Japan

In [13]:
list_tuples = [(1990, 'Italy', 'Germaby', 115),
              (1994, 'USA', 'Brazil', 141),
              (1998, 'France', 'France', 171),
              (2002, 'Japan', 'Brazil', 161)]
df_l_t = pd.DataFrame(list_tuples, columns = ['Year', 'Host_country', 'Winner', 'Goals_Scored'])
df_l_t

   Year Host_country   Winner  Goals_Scored
0  1990        Italy  Germaby           115
1  1994          USA   Brazil           141
2  1998       France   France           171
3  2002        Japan   Brazil           161

In [14]:
list_dict = [{'year':1990, 'Country':'Italy', 'Winner':'Germaby', 'Goal Scored':115},
              {'year':1994, 'Country':'USA', 'Winner':'Brazil', 'Goal Scored':141},
              {'year':1998, 'Country':'France', 'Winner':'France', 'Goal Scored':171},
              {'year':2002, 'Country':'Japan', 'Winner':'Brazil', 'Goal Scored':161}]
df_l_d = pd.DataFrame(list_dict)
df_l_d

   year Country   Winner  Goal Scored
0  1990   Italy  Germaby          115
1  1994     USA   Brazil          141
2  1998  France   France          171
3  2002   Japan   Brazil          161

Melwin Slicing even the end value is included (Inclusive) (Only in the Series)

zip function (combining the data frame)